# Задача 2.2. 

# Напишите функцию, которая возвращает номер квартал по номеру месяца
# Например: 
# месяц 2 (февраль) является частью первого квартала; 
# месяц 6 (июнь) является частью второго квартала; 
# месяц 11 (ноябрь) является частью четвертого квартала.

def quarter_of(month):
    months = ["январь", "февраль", "март", "апрель", "мaй", "июнь", "июль", "август", "сентябрь", "октябрь", "ноябрь", "декабрь"]
    if 1 <= month <= 3:
        print(f'месяц {month} ({months[month - 1]}) является частью первого квартала')
    elif 4 <= month <= 6:
        print(f'месяц {month} ({months[month - 1]}) является частью второго квартала')
    elif 7 <= month <= 9:
        print(f'месяц {month} ({months[month - 1]}) является частью третьего квартала')
    elif 7 <= month <= 9:
        print(f'месяц {month} ({months[month - 1]}) является частью четвертого квартала')
    else:
        print('Такого месяца нет!')

n=1
quarter_of(n)